export default async function downloadReport(){
    const response = await fetch("http://localhost:3000/api/reports/generate", {
        method: "POST",
        headers: {
            "Content-Type": "application/json"
        },
        body: JSON.stringify({
            title: "ระบบจัดการฐานข้อมูล",
            teacher: "อาจารย์ ภาณี มณีชม",
            student: "นางสาว นลิศา รวงผึ้ง",
            class: "ปวส. 1/3-1",
            subject: "ระบบจัดการฐานข้อมูล",
            semester: "1",
            year: "2569",
            college: "วิทยาลัยเทคโนโลยี",
            preface: `
                ปัจจุบันเทคโนโลยีสารสนเทศมีบทบาทสำคัญต่อการดำเนินงานในด้านต่าง ๆ ไม่ว่าจะเป็นด้านการศึกษา ธุรกิจ การแพทย์ หรือหน่วยงานต่าง ๆ โดยมีข้อมูลจำนวนมากที่จำเป็นต้องจัดเก็บและบริหารจัดการอย่างเป็นระบบ ดังนั้น ฐานข้อมูล (Database) จึงเป็นส่วนสำคัญที่ช่วยในการจัดเก็บข้อมูลให้มีความเป็นระเบียบ สามารถค้นหา เพิ่ม แก้ไข และเรียกใช้งานข้อมูลได้อย่างสะดวกและรวดเร็ว

                การจัดการฐานข้อมูลที่มีประสิทธิภาพช่วยลดความซ้ำซ้อนของข้อมูล เพิ่มความถูกต้องและความปลอดภัยของข้อมูล รวมถึงช่วยให้ผู้ใช้งานสามารถนำข้อมูลไปใช้ในการวิเคราะห์และประกอบการตัดสินใจได้อย่างมีประสิทธิภาพ

                รายงานฉบับนี้จัดทำขึ้นเพื่อศึกษาเกี่ยวกับความหมาย ความสำคัญ องค์ประกอบ และหลักการทำงานของฐานข้อมูล ตลอดจนการนำฐานข้อมูลมาประยุกต์ใช้ในงานด้านต่าง ๆ เพื่อให้ผู้ศึกษาเกิดความรู้และความเข้าใจเกี่ยวกับฐานข้อมูล และสามารถนำความรู้ไปประยุกต์ใช้ในการเรียนหรือการทำงานในอนาคตได้
            `
        })
    });

    if(!response.ok){
        throw new Error("fetch fail");
    }

    return response.blob();
}

